InformationRegisters/РезультатыВыполненияПроцессовИЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияПроцессовИЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыполненияПроцессовИЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияПроцессовИЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает результат выполнения переданного объекта
//
// Объект - Ссылка на процесс или задачу
// Результат - ПеречислениеСсылка.ВариантыВыполненияПроцессовИЗадач
//
Процедура ЗаписатьРезультатПоОбъекту(Объект, Результат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияПроцессовИЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Результат = Результат;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Получает результат выполнения по процессу или задаче
//
// Параметры:
//   Объект - Ссылка на процесс или задачу
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ВариантыВыполненияПроцессовИЗадач
//
Функция РезультатВыполненияПоОбъекту(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РезультатыВыполненияПроцессовИЗадач.Результат
		|ИЗ
		|	РегистрСведений.РезультатыВыполненияПроцессовИЗадач КАК РезультатыВыполненияПроцессовИЗадач
		|ГДЕ
		|	РезультатыВыполненияПроцессовИЗадач.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
